kadaster/GeoSPARQL.org
#+TITLE: GeoSPARQL v0.1
#+AUTHOR: Wouter Beek
#+SETUPFILE: theme-readtheorg.setup

* Preliminaries

** Abbreviations

| *Abbreviation* | *Expansion*                   |
|----------------+-------------------------------|
| C              | Core                          |
| TVE            | Topology Vocabulary Extension |
| GE             | Geometry Extension            |
| GTE            | Geometry Topology Extension   |
| REE            | RDFS Entailment Extension     |
| QRE            | Query Rewrite Extension       |
|----------------+-------------------------------|
| RF             | Relation Family               |
| S              | Serialization                 |
| V              | Version                       |
|----------------+-------------------------------|
| SF             | Simple Features               |
| EG             | Egenhofer                     |
| RCC8           | Region Connection Calculus    |

** IRI prefixes

| *Alias* | *IRI Prefix*                                   |
|---------+------------------------------------------------|
| ~crs~   | http://www.opengis.net/def/crs/OGC/1.3/        |
| ~geo~   | http://www.opengis.net/ont/geosparql#          |
| ~geof~  | http://www.opengis.net/def/function/geosparql/ |
| ~geor~  | http://www.opengis.net/def/rule/geosparql/     |
| ~gml~   | http://www.opengis.net/ont/gml#                |
| ~ogc~   | http://www.opengis.net/                        |
| ~sf~    | http://www.opengis.net/ont/sf#                 |
| ~uom~   | http://www.opengis.net/def/uom/OGC/1.0/        |

* Precision

| *Precision* | *Meaning*                            | *GraphDB* | *Triply RI* |
|-------------+--------------------------------------+-----------+-------------|
|        sign | east/west or north/south             |           |             |
|       1.0e2 | must be longitude                    |           |             |
|       1.0e1 | 1111 kilometer, continent            |           |             |
|       1.0e0 | 111 kilometer, country               |           |             |
|      1.0e-1 | 11 kilometer, city                   |           |             |
|      1.0e-2 | 1.1 kilometer, village               |           |             |
|      1.0e-3 | 111 meter, large field               |           |             |
|      1.0e-4 | 11 meter, parcel of land             | ✓         |             |
|      1.0e-5 | 1.1 meter, tree                      |           |             |
|      1.0e-6 | 11 centimeter, engineering           |           |             |
|      1.0e-7 | 11 milimeter                         |           | ✓           |
|      1.0e-8 | 1.1 milimeter, tectonic plate motion |           |             |
|      1.0e-9 | 110 micron, microscopy               |           |             |

* Classes

|                          | *GraphDB* | *Triply RI* |
|--------------------------+-----------+-------------|
| ~Curve~                  | ✓         |             |
| ~geo:Feature~ (C)        |           |             |
| ~Geometry~ (GE)          |           |             |
| ~GeometryCollection~     |           |             |
| ~LinearRing~             | ✓         |             |
| ~Line~                   |           |             |
| ~LineString~             | ✓         | ✓           |
| ~MultiCurve~             |           |             |
| ~MultiLineString~        | ✓         | 🚧          |
| ~MultiPoint~             | ✓         | 🚧          |
| ~MultiPolygon~           | ✓         | 🚧          |
| ~MultiSurface~           |           |             |
| ~Point~                  | ✓         | ✓           |
| ~Polygon~                | ✓         | ✓           |
| ~geo:SpatialObject~ (C)  |           |             |
| ~SpatialReferenceSystem~ |           |             |
| ~Surface~                | ✓         |             |

** Other shapes?

| ~CircularString~    |
| ~CompoundCurve~     |
| ~CurvePolygon~      |
| ~PolyhedralSurface~ |
| ~TIN~               |
| ~Triangle~          |

