org/GeoSPARQL.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-01-08 Mon 09:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>GeoSPARQL v0.2</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wouter Beek" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">GeoSPARQL v0.2</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1798de0">1. Preliminaries</a>
<ul>
<li><a href="#orgffab0fc">1.1. Abbreviations</a></li>
<li><a href="#orgf6497ef">1.2. IRI prefixes</a></li>
</ul>
</li>
<li><a href="#org8a642dc">2. Precision</a></li>
<li><a href="#org0bc0b8b">3. Classes</a>
<ul>
<li><a href="#orgbf6cf15">3.1. Other shapes?</a></li>
</ul>
</li>
<li><a href="#orgb38c240">4. Properties</a></li>
<li><a href="#org35e6082">5. Units of measure</a></li>
<li><a href="#org7c4fd3a">6. Coordinate Reference Systems</a></li>
<li><a href="#org830b5a8">7. Datatypes</a></li>
<li><a href="#orgbb65a19">8. Topological functions</a>
<ul>
<li><a href="#org9e03d9e">8.1. RF=SF</a></li>
<li><a href="#org50cc3fc">8.2. RF=E</a></li>
<li><a href="#org08c2e9c">8.3. RF=RCC8</a></li>
</ul>
</li>
<li><a href="#org9b57fab">9. Non-topological functions</a></li>
<li><a href="#orgf80ba29">10. Exceptions</a></li>
</ul>
</div>
</div>

<div id="outline-container-org1798de0" class="outline-2">
<h2 id="org1798de0"><span class="section-number-2">1</span> Preliminaries</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgffab0fc" class="outline-3">
<h3 id="orgffab0fc"><span class="section-number-3">1.1</span> Abbreviations</h3>
<div class="outline-text-3" id="text-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Abbreviation</b></th>
<th scope="col" class="org-left"><b>Expansion</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C</td>
<td class="org-left">Core</td>
</tr>

<tr>
<td class="org-left">TVE</td>
<td class="org-left">Topology Vocabulary Extension</td>
</tr>

<tr>
<td class="org-left">GE</td>
<td class="org-left">Geometry Extension</td>
</tr>

<tr>
<td class="org-left">GTE</td>
<td class="org-left">Geometry Topology Extension</td>
</tr>

<tr>
<td class="org-left">REE</td>
<td class="org-left">RDFS Entailment Extension</td>
</tr>

<tr>
<td class="org-left">QRE</td>
<td class="org-left">Query Rewrite Extension</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">RF</td>
<td class="org-left">Relation Family</td>
</tr>

<tr>
<td class="org-left">S</td>
<td class="org-left">Serialization</td>
</tr>

<tr>
<td class="org-left">V</td>
<td class="org-left">Version</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">SF</td>
<td class="org-left">Simple Features</td>
</tr>

<tr>
<td class="org-left">EG</td>
<td class="org-left">Egenhofer</td>
</tr>

<tr>
<td class="org-left">RCC8</td>
<td class="org-left">Region Connection Calculus</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgf6497ef" class="outline-3">
<h3 id="orgf6497ef"><span class="section-number-3">1.2</span> IRI prefixes</h3>
<div class="outline-text-3" id="text-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Alias</b></th>
<th scope="col" class="org-left"><b>IRI Prefix</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>crs</code></td>
<td class="org-left"><a href="http://www.opengis.net/def/crs/OGC/1.3/">http://www.opengis.net/def/crs/OGC/1.3/</a></td>
</tr>

<tr>
<td class="org-left"><code>geo</code></td>
<td class="org-left"><a href="http://www.opengis.net/ont/geosparql">http://www.opengis.net/ont/geosparql</a>#</td>
</tr>

<tr>
<td class="org-left"><code>geof</code></td>
<td class="org-left"><a href="http://www.opengis.net/def/function/geosparql/">http://www.opengis.net/def/function/geosparql/</a></td>
</tr>

<tr>
<td class="org-left"><code>geor</code></td>
<td class="org-left"><a href="http://www.opengis.net/def/rule/geosparql/">http://www.opengis.net/def/rule/geosparql/</a></td>
</tr>

<tr>
<td class="org-left"><code>gml</code></td>
<td class="org-left"><a href="http://www.opengis.net/ont/gml">http://www.opengis.net/ont/gml</a>#</td>
</tr>

<tr>
<td class="org-left"><code>ogc</code></td>
<td class="org-left"><a href="http://www.opengis.net/">http://www.opengis.net/</a></td>
</tr>

<tr>
<td class="org-left"><code>sf</code></td>
<td class="org-left"><a href="http://www.opengis.net/ont/sf">http://www.opengis.net/ont/sf</a>#</td>
</tr>

<tr>
<td class="org-left"><code>uom</code></td>
<td class="org-left"><a href="http://www.opengis.net/def/uom/OGC/1.0/">http://www.opengis.net/def/uom/OGC/1.0/</a></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org8a642dc" class="outline-2">
<h2 id="org8a642dc"><span class="section-number-2">2</span> Precision</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right"><b>Precision</b></th>
<th scope="col" class="org-left"><b>Meaning</b></th>
<th scope="col" class="org-left"><b>GraphDB</b></th>
<th scope="col" class="org-left"><b>Triply RI</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">sign</td>
<td class="org-left">east/west or north/south</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1.0e2</td>
<td class="org-left">must be longitude</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1.0e1</td>
<td class="org-left">1111 kilometer, continent</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1.0e0</td>
<td class="org-left">111 kilometer, country</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1.0e-1</td>
<td class="org-left">11 kilometer, city</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1.0e-2</td>
<td class="org-left">1.1 kilometer, village</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1.0e-3</td>
<td class="org-left">111 meter, large field</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1.0e-4</td>
<td class="org-left">11 meter, parcel of land</td>
<td class="org-left">✓</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1.0e-5</td>
<td class="org-left">1.1 meter, tree</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1.0e-6</td>
<td class="org-left">11 centimeter, engineering</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1.0e-7</td>
<td class="org-left">11 milimeter</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">✓</td>
</tr>

<tr>
<td class="org-right">1.0e-8</td>
<td class="org-left">1.1 milimeter, tectonic plate motion</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1.0e-9</td>
<td class="org-left">110 micron, microscopy</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org0bc0b8b" class="outline-2">
<h2 id="org0bc0b8b"><span class="section-number-2">3</span> Classes</h2>
<div class="outline-text-2" id="text-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left"><b>GraphDB</b></th>
<th scope="col" class="org-left"><b>Triply RI</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>Curve</code></td>
<td class="org-left">✓</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geo:Feature</code> (C)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>Geometry</code> (GE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>GeometryCollection</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>LinearRing</code></td>
<td class="org-left">✓</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>Line</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>LineString</code></td>
<td class="org-left">✓</td>
<td class="org-left">✓</td>
</tr>

<tr>
<td class="org-left"><code>MultiCurve</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>MultiLineString</code></td>
<td class="org-left">✓</td>
<td class="org-left">🚧</td>
</tr>

<tr>
<td class="org-left"><code>MultiPoint</code></td>
<td class="org-left">✓</td>
<td class="org-left">🚧</td>
</tr>

<tr>
<td class="org-left"><code>MultiPolygon</code></td>
<td class="org-left">✓</td>
<td class="org-left">🚧</td>
</tr>

<tr>
<td class="org-left"><code>MultiSurface</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>Point</code></td>
<td class="org-left">✓</td>
<td class="org-left">✓</td>
</tr>

<tr>
<td class="org-left"><code>Polygon</code></td>
<td class="org-left">✓</td>
<td class="org-left">✓</td>
</tr>

<tr>
<td class="org-left"><code>geo:SpatialObject</code> (C)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>SpatialReferenceSystem</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>Surface</code></td>
<td class="org-left">✓</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-orgbf6cf15" class="outline-3">
<h3 id="orgbf6cf15"><span class="section-number-3">3.1</span> Other shapes?</h3>
<div class="outline-text-3" id="text-3-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>CircularString</code></td>
</tr>

<tr>
<td class="org-left"><code>CompoundCurve</code></td>
</tr>

<tr>
<td class="org-left"><code>CurvePolygon</code></td>
</tr>

<tr>
<td class="org-left"><code>PolyhedralSurface</code></td>
</tr>

<tr>
<td class="org-left"><code>TIN</code></td>
</tr>

<tr>
<td class="org-left"><code>Triangle</code></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
