kadaster/GeoSPARQL.org
* Properties

|                                | *GraphDB* | *Triply RI* |
|--------------------------------+-----------+-------------|
| ~geo:asGML~ (GE,s=GML)         |           |             |
| ~geo:asWKT~ (GE,s=WKT)         |           | ✓           |
| ~geo:coordinateDimension~ (GE) |           |             |
| ~geo:dimension~ (GE)           |           |             |
| ~geo:hasDefaultGeometry~ (GE)  |           |             |
| ~geo:hasGeometry~ (GE)         |           | ✓           |
| ~geo:hasSerialization~ (GE)    |           |             |
| ~geo:isEmpty~ (GE)             |           |             |
| ~geo:isSimple~ (GE)            |           |             |
| ~geo:spatialDimension~ (GE)    |           |             |

* Units of measure

|             | *GraphDB* | *Triply RI* |
|-------------+-----------+-------------|
| ~uom:metre~ |           |             |

* Coordinate Reference Systems

|                  | *GraphDB* | *Triply RI* |
|------------------+-----------+-------------|
| ~crs:CRS84~ (GE) |           |             |

* Datatypes

|                             | *GraphDB* | *Triply RI* |
|-----------------------------+-----------+-------------|
| ~geo:wktLiteral~ (GE,s=WKT) | ✓         | ✓           |
| ~geo:gmlLiteral~ (GE,S=GML) |           |             |

* Topological functions

** RF=SF

|                           | *Geometry types*   | *GraphDB* | *Triply RI* |
|---------------------------+--------------------+-----------+-------------|
| ~geo:sfContains~          |                    |           | not: P      |
| ~geo:sfCrosses~           | P/L, P/A, L/L, L/A |           |             |
| ~geo:sfDisjoint~          |                    |           |             |
| ~geo:sfEquals~            |                    |           |             |
| ~geo:sfIntersects~        |                    |           | 🚧          |
| ~geo:sfOverlaps~          | P/P, L/L, A/A      |           |             |
| ~geo:sfTouches~           | not: P/P           |           |             |
| ~geo:sfWithin~            |                    |           | not: P      |
|---------------------------+--------------------+-----------+-------------|
| ~geof:sfContains~ (GTE)   |                    |           | 🚧          |
| ~geof:sfCrosses~ (GTE)    |                    |           |             |
| ~geof:sfDisjoint~ (GTE)   |                    |           |             |
| ~geof:sfEquals~ (GTE)     |                    |           |             |
| ~geof:sfIntersects~ (GTE) |                    |           | 🚧          |
| ~geof:sfOverlaps~ (GTE)   |                    |           |             |
| ~geof:sfTouches~ (GTE)    |                    |           |             |
| ~geof:sfWithin~ (GTE)     |                    |           | 🚧          |

** RF=E

|                    | *Geometry types* | *GraphDB* | *Triply RI* |
|--------------------+------------------+-----------+-------------|
| ~geo:ehContains~   |                  |           |             |
| ~geo:ehCoveredBy~  | L/L, L/A, A/A    |           |             |
| ~geo:ehCovers~     | L/L, A/L, A/A    |           |             |
| ~geo:ehDisjoint~   |                  |           |             |
| ~geo:ehEquals~     |                  |           |             |
| ~geo:ehInside~     |                  |           |             |
| ~geo:ehMeet~       | not: P/P         |           |             |
| ~geo:ehOverlap~    |                  |           |             |
|--------------------+------------------+-----------+-------------|
| ~geof:ehContains~ (GTE)  |                  |           |             |
| ~geof:ehCoveredBy~ (GTE) |                  |           |             |
| ~geof:ehCovers~ (GTE)    |                  |           |             |
| ~geof:ehDisjoint~ (GTE)  |                  |           |             |
| ~geof:ehEquals~ (GTE)    |                  |           |             |
| ~geof:ehInside~ (GTE)    |                  |           |             |
| ~geof:ehMeet~ (GTE)      |                  |           |             |
| ~geof:ehOverlap~ (GTE)   |                  |           |             |

