org/GeoSPARQL.html

<div id="outline-container-orgb38c240" class="outline-2">
<h2 id="orgb38c240"><span class="section-number-2">4</span> Properties</h2>
<div class="outline-text-2" id="text-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left"><b>GraphDB</b></th>
<th scope="col" class="org-left"><b>Triply RI</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>geo:asGML</code> (GE,s=GML)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geo:asWKT</code> (GE,s=WKT)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">✓</td>
</tr>

<tr>
<td class="org-left"><code>geo:coordinateDimension</code> (GE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geo:dimension</code> (GE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geo:hasDefaultGeometry</code> (GE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geo:hasGeometry</code> (GE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">✓</td>
</tr>

<tr>
<td class="org-left"><code>geo:hasSerialization</code> (GE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geo:isEmpty</code> (GE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geo:isSimple</code> (GE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geo:spatialDimension</code> (GE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org35e6082" class="outline-2">
<h2 id="org35e6082"><span class="section-number-2">5</span> Units of measure</h2>
<div class="outline-text-2" id="text-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left"><b>GraphDB</b></th>
<th scope="col" class="org-left"><b>Triply RI</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>uom:metre</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org7c4fd3a" class="outline-2">
<h2 id="org7c4fd3a"><span class="section-number-2">6</span> Coordinate Reference Systems</h2>
<div class="outline-text-2" id="text-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left"><b>GraphDB</b></th>
<th scope="col" class="org-left"><b>Triply RI</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>crs:CRS84</code> (GE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org830b5a8" class="outline-2">
<h2 id="org830b5a8"><span class="section-number-2">7</span> Datatypes</h2>
<div class="outline-text-2" id="text-7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left"><b>GraphDB</b></th>
<th scope="col" class="org-left"><b>Triply RI</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>geo:wktLiteral</code> (GE,s=WKT)</td>
<td class="org-left">✓</td>
<td class="org-left">✓</td>
</tr>

<tr>
<td class="org-left"><code>geo:gmlLiteral</code> (GE,S=GML)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgbb65a19" class="outline-2">
<h2 id="orgbb65a19"><span class="section-number-2">8</span> Topological functions</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org9e03d9e" class="outline-3">
<h3 id="org9e03d9e"><span class="section-number-3">8.1</span> RF=SF</h3>
<div class="outline-text-3" id="text-8-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left"><b>Geometry types</b></th>
<th scope="col" class="org-left"><b>GraphDB</b></th>
<th scope="col" class="org-left"><b>Triply RI</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>geo:sfContains</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">not: P</td>
</tr>

<tr>
<td class="org-left"><code>geo:sfCrosses</code></td>
<td class="org-left">P/L, P/A, L/L, L/A</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geo:sfDisjoint</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geo:sfEquals</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geo:sfIntersects</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">🚧</td>
</tr>

<tr>
<td class="org-left"><code>geo:sfOverlaps</code></td>
<td class="org-left">P/P, L/L, A/A</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geo:sfTouches</code></td>
<td class="org-left">not: P/P</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geo:sfWithin</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">not: P</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>geof:sfContains</code> (GTE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">🚧</td>
</tr>

<tr>
<td class="org-left"><code>geof:sfCrosses</code> (GTE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geof:sfDisjoint</code> (GTE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geof:sfEquals</code> (GTE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geof:sfIntersects</code> (GTE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">🚧</td>
</tr>

<tr>
<td class="org-left"><code>geof:sfOverlaps</code> (GTE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geof:sfTouches</code> (GTE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geof:sfWithin</code> (GTE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">🚧</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org50cc3fc" class="outline-3">
<h3 id="org50cc3fc"><span class="section-number-3">8.2</span> RF=E</h3>
<div class="outline-text-3" id="text-8-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left"><b>Geometry types</b></th>
<th scope="col" class="org-left"><b>GraphDB</b></th>
<th scope="col" class="org-left"><b>Triply RI</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>geo:ehContains</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geo:ehCoveredBy</code></td>
<td class="org-left">L/L, L/A, A/A</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geo:ehCovers</code></td>
<td class="org-left">L/L, A/L, A/A</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geo:ehDisjoint</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geo:ehEquals</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geo:ehInside</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geo:ehMeet</code></td>
<td class="org-left">not: P/P</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geo:ehOverlap</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>geof:ehContains</code> (GTE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geof:ehCoveredBy</code> (GTE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geof:ehCovers</code> (GTE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geof:ehDisjoint</code> (GTE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geof:ehEquals</code> (GTE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geof:ehInside</code> (GTE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geof:ehMeet</code> (GTE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geof:ehOverlap</code> (GTE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
