kadaster/GeoSPARQL.org
** RF=RCC8

|                  | *Geometry types* | *GraphDB*  | *Triply RI* |
|------------------+------------------+------------+-------------|
| ~geo:rcc8dc~     | A/A              |            |             |
| ~geo:rcc8ec~     | A/A              |            |             |
| ~geo:rcc8eq~     | A/A              |            |             |
| ~geo:rcc8ntpp~   | A/A              |            |             |
| ~geo:rcc8ntppi~  | A/A              |            |             |
| ~geo:rcc8po~     | A/A              |            |             |
| ~geo:rcc8tppi~   | A/A              |            |             |
| ~geo:rcc8tpp~    | A/A              |            |             |
|------------------+------------------+------------+-------------|
| ~geof:rcc8dc~ (GTE) | A/A              |            |             |
| ~geof:rcc8ec~ (GTE)    | A/A              |            |             |
| ~geof:rcc8eq~ (GTE)    | A/A              |            |             |
| ~geof:rcc8ntpp~ (GTE)  | A/A              |            |             |
| ~geof:rcc8ntppi~ (GTE) | A/A              |            |             |
| ~geof:rcc8po~ (GTE)    | A/A              |            |             |
| ~geof:rcc8tppi~ (GTE)  | A/A              |            |             |
| ~geof:rcc8tpp~ (GTE)   | A/A              |            |             |

* Non-topological functions

|                           | *GraphDB* | *Triply RI* |
|---------------------------+-----------+-------------|
| ~geof:boundary~ (GE)      |           |             |
| ~geof:buffer~ (GE)        |           |             |
| ~geof:convexHull~ (GE)    |           |             |
| ~geof:difference~ (GE)    |           |             |
| ~geof:distance~ (GE)      |           | ✓           |
| ~geof:envelope~ (GE)      |           |             |
| ~geof:getSRID~ (GE)       |           |             |
| ~geof:intersection~ (GE)  |           |             |
| ~geof:symDifference~ (GE) |           |             |
| ~geof:union~ (GE)         |           |             |
| ~geof:relate~ (GTE)       |           |             |

* Exceptions

|                                   | *GraphDB* | *Triply RI* |
|-----------------------------------+-----------+-------------|
| Function argument unexpected type |           |             |
| Function invalid geometry literal |           |             |
| Function incompatible CRSes       |           |             |
| Function invalid unit             |           |             |
