org/GeoSPARQL.html

<div id="outline-container-org08c2e9c" class="outline-3">
<h3 id="org08c2e9c"><span class="section-number-3">8.3</span> RF=RCC8</h3>
<div class="outline-text-3" id="text-8-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left"><b>Geometry types</b></th>
<th scope="col" class="org-left"><b>GraphDB</b></th>
<th scope="col" class="org-left"><b>Triply RI</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>geo:rcc8dc</code></td>
<td class="org-left">A/A</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geo:rcc8ec</code></td>
<td class="org-left">A/A</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geo:rcc8eq</code></td>
<td class="org-left">A/A</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geo:rcc8ntpp</code></td>
<td class="org-left">A/A</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geo:rcc8ntppi</code></td>
<td class="org-left">A/A</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geo:rcc8po</code></td>
<td class="org-left">A/A</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geo:rcc8tppi</code></td>
<td class="org-left">A/A</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geo:rcc8tpp</code></td>
<td class="org-left">A/A</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>geof:rcc8dc</code> (GTE)</td>
<td class="org-left">A/A</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geof:rcc8ec</code> (GTE)</td>
<td class="org-left">A/A</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geof:rcc8eq</code> (GTE)</td>
<td class="org-left">A/A</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geof:rcc8ntpp</code> (GTE)</td>
<td class="org-left">A/A</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geof:rcc8ntppi</code> (GTE)</td>
<td class="org-left">A/A</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geof:rcc8po</code> (GTE)</td>
<td class="org-left">A/A</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geof:rcc8tppi</code> (GTE)</td>
<td class="org-left">A/A</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geof:rcc8tpp</code> (GTE)</td>
<td class="org-left">A/A</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org9b57fab" class="outline-2">
<h2 id="org9b57fab"><span class="section-number-2">9</span> Non-topological functions</h2>
<div class="outline-text-2" id="text-9">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left"><b>GraphDB</b></th>
<th scope="col" class="org-left"><b>Triply RI</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>geof:boundary</code> (GE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geof:buffer</code> (GE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geof:convexHull</code> (GE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geof:difference</code> (GE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geof:distance</code> (GE)</td>
<td class="org-left">✓</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geof:envelope</code> (GE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geof:getSRID</code> (GE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geof:intersection</code> (GE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geof:symDifference</code> (GE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geof:union</code> (GE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>geof:relate</code> (GTE)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgf80ba29" class="outline-2">
<h2 id="orgf80ba29"><span class="section-number-2">10</span> Exceptions</h2>
<div class="outline-text-2" id="text-10">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left"><b>GraphDB</b></th>
<th scope="col" class="org-left"><b>Triply RI</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Function argument unexpected type</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Function invalid geometry literal</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Function incompatible CRSes</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Function invalid unit</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Wouter Beek</p>
<p class="date">Created: 2018-01-08 Mon 09:53</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
